In [1]:
import pandas as pd

In [2]:
sales = pd.Series([15, 32, 45, 21, 55, 15, 0],
                  index = ["Mon", "Tue", "Wed", "Thu", "Fri", "Sat", "Sun"])

In [3]:
sales

Mon    15
Tue    32
Wed    45
Thu    21
Fri    55
Sat    15
Sun     0
dtype: int64

In [4]:
sales.sort_values(ascending = False)

Fri    55
Wed    45
Tue    32
Thu    21
Mon    15
Sat    15
Sun     0
dtype: int64

In [5]:
sales.rank()

Mon    2.5
Tue    5.0
Wed    6.0
Thu    4.0
Fri    7.0
Sat    2.5
Sun    1.0
dtype: float64

In [6]:
sales.rank().sort_values()

Sun    1.0
Mon    2.5
Sat    2.5
Thu    4.0
Tue    5.0
Wed    6.0
Fri    7.0
dtype: float64

In [7]:
sales.rank(ascending = False)

Mon    5.5
Tue    3.0
Wed    2.0
Thu    4.0
Fri    1.0
Sat    5.5
Sun    7.0
dtype: float64

In [8]:
sales.rank().sort_values(ascending = False)

Fri    7.0
Wed    6.0
Tue    5.0
Thu    4.0
Mon    2.5
Sat    2.5
Sun    1.0
dtype: float64

In [9]:
sales.rank(ascending = False).sort_values(ascending = False)

Sun    7.0
Mon    5.5
Sat    5.5
Thu    4.0
Tue    3.0
Wed    2.0
Fri    1.0
dtype: float64

In [10]:
sales.rank(ascending = False, method = "average", pct = False).sort_values()

Fri    1.0
Wed    2.0
Tue    3.0
Thu    4.0
Mon    5.5
Sat    5.5
Sun    7.0
dtype: float64

In [11]:
sales.rank(ascending = False, method = "average", pct = True).sort_values()

Fri    0.142857
Wed    0.285714
Tue    0.428571
Thu    0.571429
Mon    0.785714
Sat    0.785714
Sun    1.000000
dtype: float64

## titanic dataset

In [12]:
titanic = pd.read_csv("titanic.csv")

In [13]:
titanic.fare.rank(ascending = False)

0      815.0
1      103.0
2      659.5
3      144.0
4      628.0
       ...
886    484.5
887    237.5
888    345.5
889    237.5
890    768.5
Name: fare, Length: 891, dtype: float64

In [14]:
titanic["fare_rank"] = titanic.fare.rank(ascending = False, method = "min")

In [15]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,fare_rank
0,0,3,male,22.0,1,0,7.2500,S,NaN,809.0
1,1,1,female,38.0,1,0,71.2833,C,C,103.0
2,1,3,female,26.0,0,0,7.9250,S,NaN,651.0
3,1,1,female,35.0,1,0,53.1000,S,C,142.0
4,0,3,male,35.0,0,0,8.0500,S,NaN,607.0

In [16]:
titanic.sort_values("fare", ascending = False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,fare_rank
258,1,1,female,35.0,0,0,512.3292,C,NaN,1.0
737,1,1,male,35.0,0,0,512.3292,C,B,1.0
679,1,1,male,36.0,0,1,512.3292,C,B,1.0
88,1,1,female,23.0,3,2,263.0000,S,C,4.0
27,0,1,male,19.0,3,2,263.0000,S,C,4.0
...,...,...,...,...,...,...,...,...,...,...
633,0,1,male,NaN,0,0,0.0000,S,NaN,877.0
413,0,2,male,NaN,0,0,0.0000,S,NaN,877.0
822,0,1,male,38.0,0,0,0.0000,S,NaN,877.0
732,0,2,male,NaN,0,0,0.0000,S,NaN,877.0
674,0,2,male,NaN,0,0,0.0000,S,NaN,877.0

In [17]:
titanic.drop(columns = "fare_rank", inplace = True)

In [18]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN